bluntBody/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
//z=0
    (-2.5 0.0 0.0 )
    (-0.5 0.0 0.0 )
    ( 0.0 0.5 0.0 )
    ( 1.0 5.0 0.0 )
//z=0.1
    (-2.5 0.0 0.1 )
    (-0.5 0.0 0.1 )
    ( 0.0 0.5 0.1 )
    ( 1.0 5.0 0.1 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 50 1) simpleGrading (0.5 1 1)

);

edges
(

	arc 1 2	(-0.35255  0.35355 0.0 )
	arc 5 6 (-0.35255  0.35355 0.1 )

	arc 3 0	(-2.49049 0.21789 0.0 )
	arc 7 4	(-2.49049 0.21789 0.1 )

);



boundary
(
    body
    {
        type wall;
        faces
        (
            (1 2 6 5)

        );
    }
    dummy 
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    top
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }

); //end boundary



// ************************************************************************* //
